---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewVisibleCategories
source: html/21d9691e-6809-11a5-6da0-01f6d4716c4a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewVisibleCategories Property

"Visibility/Graphics Overrides"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewVisibleCategories { get; }
```